blog/_posts/2013-11/2013-11-06-MetaData.html
---
layout: post
keywords: 
description: 
title: 元数据(MetaData) 
categories: [something]
tags: [metadata]
group: archive
icon: code
featured: false
---

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 元数据</a></li>
<li><a href="#sec-2">2 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">元数据</h2>
<div class="outline-text-2" id="text-1">

<p>元数据是用来描述数据的数据（Data that describes other data）。
</p>
<p>
下面是契诃夫的小说《套中人》中的一段，描写一个叫做瓦莲卡的女子：
</p>


<pre class="src src-sh">&#24180;&#32426;&#24050;&#32463;&#19981;&#36731;&#65292;&#19977;&#21313;&#23681;&#19978;&#19979;&#65292;&#20010;&#23376;&#39640;&#25361;&#65292;&#36523;&#26448;&#21248;&#31216;&#65292;&#40657;&#40657;&#30340;&#30473;&#27611;&#65292;&#32418;&#32418;&#30340;&#33080;&#34507;&#65293;&#65293;&#19968;&#21477;&#35805;&#65292;&#19981;&#26159;&#22993;&#23064;&#65292;&#32780;&#26159;&#26524;&#20923;&#65292;&#22905;&#37027;&#26679;&#27963;&#36291;&#65292;&#21557;&#21557;&#22199;&#22199;&#65292;&#19981;&#20572;&#22320;&#21756;&#30528;&#23567;&#20420;&#32599;&#26031;&#30340;&#25234;&#24773;&#27468;&#26354;&#65292;&#39640;&#22768;&#22823;&#31505;&#65292;&#21160;&#19981;&#21160;&#23601;&#21457;&#20986;&#19968;&#36830;&#20018;&#21709;&#20142;&#30340;&#31505;&#22768;&#65306;&#21704;&#65292;&#21704;&#65292;&#21704;&#65281;
</pre>

<p>
这段话里提供了这样几个信息：年龄（三十岁上下）、身高（个子高挑）、相貌（身材匀称，黑黑的眉毛，红红的脸蛋）、性格（活跃，吵吵嚷嚷，不停地哼着小俄罗斯的抒情歌曲，高声大笑）。有了这些信息，我们就可以大致想像出瓦莲卡是个什么样的人。推而广之，只要提供这几类的信息，我们也可以推测出其他人的样子。
</p>
<p>
这个例子中的“年龄”、“身高”、“相貌”、“性格”，就是元数据，因为它们是用来描述具体数据/信息的数据/信息。
</p>
<p>
当然，这几个元数据用来刻画个人状况还不够精确。我们每个人从小到大，都填过《个人情况登记表》之类的东西吧，其中包括姓名、性别、民族、政治面貌、一寸照片、学历、职称等等……这一套元数据才算比较完备。
</p>
<p>
再举一个例子。在电影数据库<a href="http://www.imdb.com/">IMDB</a> 上可以查到每一部电影的信息。IMDB本身也定义了一套元数据，用来描述每一部电影。下面是它的一级元数据，每一级下面又列出了二级元数据，总共加起来，可以从100多个方面刻画一部电影：
</p>


<pre class="src src-sh">Cast and Crew&#65288;&#28436;&#32844;&#20154;&#21592;&#65289;&#12289;Company Credits&#65288;&#30456;&#20851;&#20844;&#21496;&#65289;&#12289;Basic Data&#65288;&#22522;&#26412;&#24773;&#20917;&#65289;&#12289;Plot &amp; Quotes&#65288;&#24773;&#33410;&#21644;&#24341;&#35821;&#65289;&#12289;Fun Stuff&#65288;&#36259;&#21619;&#20449;&#24687;&#65289;&#12289;Links to Other Sites&#65288;&#22806;&#37096;&#38142;&#25509;&#65289;&#12289;Box Office and Business&#65288;&#31080;&#25151;&#21644;&#21830;&#19994;&#24320;&#21457;&#65289;&#12289;Technical Info&#65288;&#25216;&#26415;&#20449;&#24687;&#65289;&#12289;Literature&#65288;&#20070;&#38754;&#20869;&#23481;&#65289;&#12289;Other Data&#65288;&#20854;&#20182;&#20449;&#24687;&#65289;&#12290;
</pre>

<p>
元数据最大的好处是，它使信息的描述和分类可以实现格式化，从而为机器处理创造了可能。
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">参考资料</h2>
<div class="outline-text-2" id="text-2">

<p><a href="http://www.ruanyifeng.com/blog/2007/03/metadata.html">http://www.ruanyifeng.com/blog/2007/03/metadata.html</a>
</p></div>
</div>
